Tutorials/pimpleHFDIBFoam/fallingParticle/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  3.0.x                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
bodyNames ( "icoSphere" );

interpolationSchemes
{
  U cellPointFace;
  method line;
}

surfaceThreshold    1e-4;
stepDEM     0.02;
geometricD (1 -1 1);
recordSimulation true;

outputSetup
{
    basic true;
    iB  false;
    DEM false;
    addModel true;
}

DEM
{
    materials
    {
        particle
        {
            Y       1e7;
            nu      0.3;
            gamma   5e-6;
            mu      0.05;
            adhN    0;
        }
        
        wall
        {
            Y       1e7;
            nu      0.2;
            gamma   5e-6;
            mu      0;
            adhN    0;
        }   
    }

    collisionPatches
    {
        x0 wall;
        x1 wall;
        z0 wall;
        z1 wall;
    }
}

icoSphere
{
fullyCoupledBody;
rho         rho [1 -3 0 0 0 0 0] 3950;
refineMC 5;
U
{
	BC  noSlip;
}
material particle;
bodyGeom convex;
updateTorque false;
sdBasedLambda false;
interfaceSpan 1.0;
startSynced false;
refineBuffers 2;
timesToSetStatic 30; //number of timeSteps in contact with wall/static body to set body as static. Never when -1
bodyAddition
{
	addModel distribution;
    distributionCoeffs
    {
        stlBaseSize     0.005;
        addMode             fieldBased;
        fieldBasedCoeffs
        {
            fieldName   lambda;                                      //name of the indicator field
            fieldValue	0.05;                                        //minimal field value before addition
        }
        
        addDomain      boundBox;
        boundBoxCoeffs
        {
            minBound (0 -0.001 -0.03);
            maxBound (0.04 0.001 0.03);
        }
        
        scalingMode    noScaling;
        noScalingCoeffs{};
        rotationMode   noRotation;
        noRotationCoeffs{};
    }
}
}

sphereSTL
{
fullyCoupledBody;
rho         rho [1 -3 0 0 0 0 0] 3950;
refineMC 5;
U
{
	BC  noSlip;
}
Y       1e7;
nu      0.2;
gamma   4e-6;
mu      0;
adhN    0;
bodyGeom convex;
updateTorque false;
sdBasedLambda false;
interfaceSpan 1.0;
startSynced false;
velRelaxFac 0.1;
refineBuffers 2;
useInterpolation false;
timesToSetStatic -1; //number of timeSteps in contact with wall/static body to set body as static. Never when -1
bodyAddition
{
	addModel repeatSamePosition;
    repeatSamePositionCoeffs
    {
        timeBetweenUsage   0.02;                                   //how often to add
        useNTimes           10;
        addMode            timeBased;
//         addMode             fieldBased;
        timeBasedCoeffs
        {
            timeBetweenUsage   0.02;                                   //how often to add
            partPerAdd         1;                                       //how many particles use by one addition
        }
        fieldBasedCoeffs
        {
            fieldName   lambda;                                      //name of the indicator field
            //~ fieldValue	0.5;                                         //minimal field value before addition
            //~ fieldValue	0.3;                                       //minimal field value before addition
            fieldValue	0.05;                                         //minimal field value before addition
            //~ fieldValue	0.1;                                         //minimal field value before addition
        }
        
        addDomain      boundBox;//boundBox//domain//cellZone  
        boundBoxCoeffs
        {
            minBound (0 -0.001 -0.03);
            maxBound (0.04 0.001 0.03);
        }
        
        scalingMode    noScaling;//noScaling//randomScaling//scaleToFit;
        //~ scalingMode    scaleToFit;//noScaling//randomScaling//scaleToFit;
        //~ scalingMode    randomScaling;//noScaling//randomScaling//scaleToFit;
        noScalingCoeffs{};
        randomScalingCoeffs
        {
            minScale   0.5;
            maxScale   2.0;
        }
        
        scaleToFitCoeffs
        {//Note (MI): max scale0 is one in this case
            scaleStep  0.95;
            minScale   0.2;
            nTriesBeforeScaling	60;
        }
        
        //~ rotationMode   randomRotation;//noRotation;//randomRotation//fixedAxisRandomRotation
        //~ rotationMode   fixedAxisRandomRotation;
        rotationMode   noRotation;
        noRotationCoeffs{}
        randomRotationCoeffs{}
        fixedAxisRandomRotationCoeffs
        {
            axis     (0 0 1);
        }
    }
}
}

sphere
{
fullyCoupledBody;
rho         rho [1 -3 0 0 0 0 0] 3950;
refineMC 5;
U
{
	BC  noSlip;
}
Y       1e7;
nu      0.2;
gamma   4e-6;
mu      0;
adhN    0;
bodyGeom sphere;
sphere
{
    startPosition   (0.018 0 0);
    radius  0.015;
}
updateTorque false;
sdBasedLambda false;
interfaceSpan 1.0;
startSynced false;
velRelaxFac 0.1;
refineBuffers 2;
useInterpolation false;
timesToSetStatic -1; //number of timeSteps in contact with wall/static body to set body as static. Never when -1
bodyAddition
{
	addModel distribution;
    distributionCoeffs
    {
        stlBaseSize     0.015;
        //~ addMode            timeBased;
        addMode             fieldBased;
        timeBasedCoeffs
        {
            useNTimes          1;                                      //how many times to add
            timeBetweenUsage   0.01;                                   //how often to add
            partPerAdd         1;                                       //how many particles use by one addition
        }
        fieldBasedCoeffs
        {
            fieldName   lambda;                                      //name of the indicator field
            //~ fieldValue	0.5;                                         //minimal field value before addition
            //~ fieldValue	0.3;                                       //minimal field value before addition
            fieldValue	0.05;                                         //minimal field value before addition
            //~ fieldValue	0.1;                                         //minimal field value before addition
        }
        
        addDomain      boundBox;//boundBox//domain//cellZone  
        boundBoxCoeffs
        {
            minBound (0 -0.001 -0.03);
            maxBound (0.04 0.001 0.03);
        }
        
        scalingMode    noScaling;//noScaling//randomScaling//scaleToFit;
        //~ scalingMode    scaleToFit;//noScaling//randomScaling//scaleToFit;
        //~ scalingMode    randomScaling;//noScaling//randomScaling//scaleToFit;
        noScalingCoeffs{};
        randomScalingCoeffs
        {
            minScale   0.5;
            maxScale   2.0;
        }
        
        scaleToFitCoeffs
        {//Note (MI): max scale0 is one in this case
            scaleStep  0.95;
            minScale   0.2;
            nTriesBeforeScaling	60;
        }
        
        //~ rotationMode   randomRotation;//noRotation;//randomRotation//fixedAxisRandomRotation
        //~ rotationMode   fixedAxisRandomRotation;
        rotationMode   noRotation;
        noRotationCoeffs{}
        randomRotationCoeffs{}
        fixedAxisRandomRotationCoeffs
        {
            axis     (0 0 1);
        }
    }
}
}
// ************************************************************************* //
